olliw42/stm32ll-lib/src/stdstm32-uart.h
#endif // defined UART_USE_RX || defined UART_USE_TX_ISR


//-------------------------------------------------------
// TX routines
//-------------------------------------------------------
#ifdef UART_USE_TX

uint16_t uart_putc(char c)
{
#ifndef UART_USE_TX_ISR
  while (!LL_USART_IsActiveFlag_TC(UART_UARTx)) {}
  LL_USART_TransmitData8(UART_UARTx, c);
  return 1;
#else
  uint16_t next = (uart_txwritepos + 1) & UART_TXBUFSIZEMASK;
  if (uart_txreadpos != next) { // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
    uart_txbuf[next] = c;
    uart_txwritepos = next;
    LL_USART_EnableIT_TXE(UART_UARTx); // enable interrupt // then TDR is empty, the TXE bit is set, and hence the isr is triggered
    return 1;
  }
  return 0;
#endif
}


void uart_puts(const char *s)
{
  while (*s) {
    uart_putc(*s);
    s++;
  }
}


void uart_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uart_putc(buf[i]);
}


#ifdef UART_USE_TX_ISR
uint16_t uart_tx_notfull(void)
{
  uint16_t next = (uart_txwritepos + 1) & UART_TXBUFSIZEMASK;
  return (uart_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uart_tx_isempty(void)
{
  if (uart_txwritepos == uart_txreadpos) return 1;
  return 0;
}


static inline void uart_tx_flush(void)
{
  uart_txwritepos = uart_txreadpos = 0;
}
#else
static inline void uart_tx_flush(void) {}
#endif

#endif // defined UART_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UART_USE_RX

static inline uint16_t uart_rx_available(void)
{
  if (uart_rxwritepos == uart_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uart_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uart_rxwritepos - (int16_t)uart_rxreadpos;
  return (d < 0) ? d + (UART_RXBUFSIZEMASK + 1) : d;
}


char uart_getc(void)
{
  while (uart_rxwritepos == uart_rxreadpos) {};
  uart_rxreadpos = (uart_rxreadpos + 1) & UART_RXBUFSIZEMASK;
  return uart_rxbuf[uart_rxreadpos];
}


static inline char uart_lookatnextc(void)
{
  return uart_rxbuf[(uart_rxreadpos + 1) & UART_RXBUFSIZEMASK];
}


static inline void uart_rx_flush(void)
{
  uart_rxwritepos = uart_rxreadpos = 0;
}

#endif // defined UART_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------

#if !(defined UART_USE_LPUART1 || defined UART_USE_LPUART1_REMAPPED) || defined STM32WL
// for the moment, we don't support these functions for LPUART, except for WLE5xx

void uart_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
LL_USART_InitTypeDef USART_InitStruct = {0};

  LL_USART_StructInit(&USART_InitStruct);
  USART_InitStruct.BaudRate = baud;
  USART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  USART_InitStruct.StopBits = stopbits;
  USART_InitStruct.Parity = parity;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  LL_USART_Disable(UART_UARTx); // must be disabled to configure some registers
  LL_USART_Init(UART_UARTx, &USART_InitStruct);
  LL_USART_Enable(UART_UARTx);
}


void uart_setbaudrate(uint32_t baud)
{
LL_USART_InitTypeDef USART_InitStruct = {0};

  LL_USART_StructInit(&USART_InitStruct);
  USART_InitStruct.BaudRate = baud;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  LL_USART_Disable(UART_UARTx); // must be disabled to configure some registers
  LL_USART_Init(UART_UARTx, &USART_InitStruct);
  LL_USART_Enable(UART_UARTx);
}


void uart_tx_enable(FunctionalState flag)
{
#ifdef UART_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UART_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UART_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UART_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}

#endif


void uart_rx_enableisr(FunctionalState flag)
{
#ifdef UART_USE_RX
  if (flag == ENABLE) {
    // Enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UART_UARTx);
#endif
    LL_USART_EnableIT_RXNE(UART_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UART_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UART_UARTx);
#endif
  }
#endif
}


void uart_init_isroff(void)
{
  LL_USART_Disable(UART_UARTx);

  // Initialize clocks for USART/LPUART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UART_UARTx);
#ifdef STM32F1
#if defined UART_USE_UART1_REMAPPED
  LL_GPIO_AF_EnableRemap_USART1();
#endif
#if defined UART_USE_UART2_REMAPPED
  LL_GPIO_AF_EnableRemap_USART2();
#endif
#if defined UART_USE_UART3_REMAPPED
  LL_GPIO_AF_RemapPartial_USART3();
#endif
#endif // STM32F1

  // Configure pin USART/LPUART Tx as alternative function push-pull
#ifdef UART_USE_TX
  gpio_init_af(UART_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UART_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART/LPUART Rx as input with pull up
#ifdef UART_USE_RX
  gpio_init_af(UART_RX_IO, IO_MODE_INPUT_PU, UART_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure USART/LPUART
#if !(defined UART_USE_LPUART1 || defined UART_USE_LPUART1_REMAPPED) || defined STM32WL
LL_USART_InitTypeDef USART_InitStruct = {0};
  USART_InitStruct.BaudRate = UART_BAUD;
  USART_InitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
  USART_InitStruct.StopBits = LL_USART_STOPBITS_1;
  USART_InitStruct.Parity = LL_USART_PARITY_NONE;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  USART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4 || defined STM32WL
  USART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif
  LL_USART_Init(UART_UARTx, &USART_InitStruct);
  LL_USART_ConfigAsyncMode(UART_UARTx);
#if defined STM32G4 || defined STM32WL
  LL_USART_DisableFIFO(UART_UARTx);
  LL_USART_SetTXFIFOThreshold(UART_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UART_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#endif
#else
LL_LPUART_InitTypeDef LPUART_InitStruct = {0};
  LPUART_InitStruct.BaudRate = UART_BAUD;
  LPUART_InitStruct.DataWidth = LL_LPUART_DATAWIDTH_8B;
  LPUART_InitStruct.StopBits = LL_LPUART_STOPBITS_1;
  LPUART_InitStruct.Parity = LL_LPUART_PARITY_NONE;
  LPUART_InitStruct.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
  LPUART_InitStruct.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
  LPUART_InitStruct.PrescalerValue = LL_LPUART_PRESCALER_DIV1;
  LL_LPUART_Init(UART_UARTx, &LPUART_InitStruct);
  LL_LPUART_DisableFIFO(UART_UARTx);
  LL_LPUART_SetTXFIFOThreshold(UART_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
  LL_LPUART_SetRXFIFOThreshold(UART_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
#endif

  // Configure NVIC channel
#if defined UART_USE_RX || defined UART_USE_TX_ISR
#ifdef UART_PREEMPTIONPRIORITY
  #error Legacy UART_PREEMPTIONPRIORITY used !
#endif
#ifdef UART_SUBPRIORITY
  #error Legacy UART_SUBPRIORITY used !
#endif
#ifdef UART_PRIORITY
#error Legacy UART_PRIORITY used !
#endif
#ifndef UART_IRQ_PRIORITY
  #define UART_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UART_IRQn, UART_IRQ_PRIORITY);
#endif

#ifdef UART_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UART_UARTx);
  LL_USART_ClearFlag_TC(UART_UARTx);
  // Flush buffer
  uart_txwritepos = uart_txreadpos = 0;
#endif

#ifdef UART_USE_RX
  // Disable Receive Data register not empty interrupt
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UART_UARTx);
#endif
  LL_USART_EnableIT_RXNE(UART_UARTx);
  // Flush buffer
  uart_rxwritepos = uart_rxreadpos = 0;
#ifdef UART_USE_RXERRORCOUNT
  uart_errorcnt_rxnoise = 0;
  uart_errorcnt_rxframe = 0;
  uart_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UART_UARTx->CR2, (USART_CR2_LINEN | USART_CR2_CLKEN));
  CLEAR_BIT(UART_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_HDSEL | USART_CR3_IREN));

#if defined STM32F7
  // reading the F722 manual I've added this
  CLEAR_BIT(UART_UARTx->CR1, (USART_CR1_EOBIE | USART_CR1_RTOIE | USART_CR1_CMIE | USART_CR1_PEIE | USART_CR1_IDLEIE));
  CLEAR_BIT(UART_UARTx->CR2, (USART_CR2_RTOEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL | USART_CR2_LBDIE | USART_CR2_LBDL));
  CLEAR_BIT(UART_UARTx->CR3, (USART_CR3_TCBGTIE | USART_CR3_CTSIE | USART_CR3_EIE));
#if !defined UART_USE_RXERRORCOUNT
  // Disable ORE in the first place
  LL_USART_DisableOverrunDetect(UART_UARTx); // disables ORE, check how F1 is behaving
#endif
#endif

#if defined STM32G4 || defined STM32WL
#if !defined UART_USE_RXERRORCOUNT
  LL_USART_DisableOverrunDetect(UART_UARTx);
#endif
#endif

  // Enable USART/LPUART
  LL_USART_Enable(UART_UARTx);

#if defined STM32G4 || defined STM32WL
  // Polling UART/LPUART initialisation
  while((!(LL_USART_IsActiveFlag_TEACK(UART_UARTx))) || (!(LL_USART_IsActiveFlag_REACK(UART_UARTx)))) {};
#endif
}


void uart_init(void)
{
  uart_init_isroff();
  uart_rx_enableisr(ENABLE);
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_UART_H
